small_hearth/results_small_hearth_250227_102117/CFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    outlet
    {
        type            patch;
        nFaces          4;
        startFace       29536;
    }
    inlet
    {
        type            patch;
        nFaces          128;
        startFace       29540;
    }
    atmosphere
    {
        type            patch;
        nFaces          384;
        startFace       29668;
    }
    walls
    {
        type            patch;
        nFaces          1804;
        startFace       30052;
    }
)

// ************************************************************************* //
